<script lang="js" setup>
import { ref } from 'vue'

const array = ref([
  {
    title: 'Что такое Клуб британских поваров?',
    description:
      'Great British Chefs Club - это новая захватывающая зона для тех, кто по-настоящему любит готовить. Члены клуба получат доступ к эксклюзивным рецептам, статьям и видео на полгода раньше бесплатных пользователей, а также возможность участвовать в конкурсах только для членов клуба, получать скидки на высококачественные кухонные принадлежности и особые привилегии при посещении ресторанов.'
  },
  {
    title: 'Что я получу, если стану участником Серебряного и Золотого уровней?',
    description:
      'Участники Серебряного уровня получают ранний доступ к эксклюзивным рецептам, функциям и видео, а также возможность участвовать в конкурсах только для участников. Участники уровня Gold получают все, что входит в Silver, плюс бесплатные подарки и возможность выиграть призы, которые нельзя купить за деньги, вместе с нашими шеф-поварами (и еще больше преимуществ в будущем!).'
  },
  {
    title: 'Что я получу, если присоединюсь к бесплатному уровню?',
    description:
      'Пользователи, присоединившиеся к бесплатному уровню, получают дополнительно два рецепта или блюда в день (всего пять), по сравнению с пользователями, не создавшими аккаунт (которые получают только три). Вы также получите доступ к странице учетной записи, где вы сможете подписаться на рассылку новостей и использовать нашу папку Binder для сохранения ваших любимых рецептов.'
  },
  {
    title: 'Как мне будет выставляться счет?',
    description:
      'Членство будет автоматически продлеваться каждый месяц или двенадцать месяцев, в зависимости от того, платите ли вы ежемесячно или ежегодно. Мы всегда будем снимать деньги с того же счета, на который вы изначально подписались - если вы хотите использовать другой счет, пожалуйста, свяжитесь с нами.'
  },
  {
    title: 'Что произойдет, если я стану Серебряным или Золотым?',
    description:
      'Как только вы вступите в наш клуб, вы будете перенаправлены в раздел для участников, где вы найдете все наши рецепты и функции, доступные только для участников. Мы также отправим вам подтверждение по электронной почте, как только ваше членство будет подтверждено.'
  },
  {
    title: 'Что, если я захочу отменить свое членство?',
    description:
      'Вы можете отменить свое членство в любое время - просто напишите нам на silvermembership@greatbritishchefs.com или goldmembership@greatbritishchefs.com (в зависимости от того, на каком уровне вы состоите). Вы сможете просматривать наш премиум-контент до тех пор, пока не закончится срок действия вашего членства.'
  },
  {
    title: 'А если у меня возникнет другой вопрос?',
    description:
      'Пожалуйста, свяжитесь с нами по адресу info@greatbritishchefs.com, и мы будем рады помочь!'
  }
])
</script>

<template>
  <section>
    <svg>
      <use xlink:href="/src/assets/images/sprites.svg#knife"></use>
    </svg>

    <h2>FAQs</h2>

    <p>
      Чтобы получить полную информацию о том, что вы получите, вступив в наш клуб, перейдите по
      ссылке. Ниже приведены некоторые из наиболее часто задаваемых нами вопросов.
    </p>

    <ul v-for="el of array" :key="el">
      <li>
        <h3>{{ el.title }}</h3>
      </li>

      <li>{{ el.description }}</li>
    </ul>
  </section>
</template>

<style lang="scss" scoped>
section {
  display: grid;
  gap: calc(var(--scheme-gap) * 2);

  p {
    max-width: 550px;
  }

  ul {
    display: grid;
    gap: var(--scheme-gap);
    justify-self: flex-start;
  }

  svg {
    height: 20px;
    width: 147px;
  }
}
</style>
